sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
void bno055_calibrate_mag(float *dest1)
{
	uint8_t data[6]; // data array to hold mag x, y, z, data
	uint16_t ii = 0, sample_count = 0;
	int32_t mag_bias[3] = {0, 0, 0};
	int16_t mag_max[3] = {0, 0, 0}, mag_min[3] = {0, 0, 0};

	NRF_LOG_INFO("Mag Calibration: Wave device in a figure eight until done!");
	nrf_delay_ms(4000);

	// Select page 0 to read sensors
	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x00);
	// Select BNO055 system operation mode as NDOF for calibration
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, AMG );

	// In NDF fusion mode, mag data is in 16 LSB/microTesla, ODR is 20 Hz in forced mode
	sample_count = 256;
	for(ii = 0; ii < sample_count; ii++) {
		int16_t mag_temp[3] = {0, 0, 0};
		readBytes(BNO055_ADDRESS, BNO055_MAG_DATA_X_LSB, 6, &data[0]);  // Read the six raw data registers into data array
		mag_temp[0] = (int16_t) (((int16_t)data[1] << 8) | data[0]) ;   // Form signed 16-bit integer for each sample in FIFO
		mag_temp[1] = (int16_t) (((int16_t)data[3] << 8) | data[2]) ;
		mag_temp[2] = (int16_t) (((int16_t)data[5] << 8) | data[4]) ;
		for (int jj = 0; jj < 3; jj++) {
			if (ii == 0) {
				mag_max[jj] = mag_temp[jj]; // Offsets may be large enough that mag_temp[i] may not be bipolar! 
				mag_min[jj] = mag_temp[jj]; // This prevents max or min being pinned to 0 if the values are unipolar...
			} else {
				if(mag_temp[jj] > mag_max[jj]) mag_max[jj] = mag_temp[jj];
				if(mag_temp[jj] < mag_min[jj]) mag_min[jj] = mag_temp[jj];
			}
		}
		nrf_delay_ms(105);  // at 10 Hz ODR, new mag data is available every 100 ms
	}

	NRF_LOG_INFO("mag x min/max: %d, %d\n", mag_min[0], mag_max[0]);
	NRF_LOG_INFO("mag y min/max: %d, %d\n", mag_min[1], mag_max[1]);
	NRF_LOG_INFO("mag z min/max: %d, %d\n", mag_min[2], mag_max[2]);

	mag_bias[0]  = (mag_max[0] + mag_min[0])/2;  // get average x mag bias in counts
	mag_bias[1]  = (mag_max[1] + mag_min[1])/2;  // get average y mag bias in counts
	mag_bias[2]  = (mag_max[2] + mag_min[2])/2;  // get average z mag bias in counts

	dest1[0] = (float) mag_bias[0] / 1.6;  // save mag biases in mG for use in main program
	dest1[1] = (float) mag_bias[1] / 1.6;  // mag data is 1.6 LSB/mg
	dest1[2] = (float) mag_bias[2] / 1.6;          

	// Return to config mode to write mag biases in offset register
	// This offset register is only used while in fusion mode when magnetometer sensitivity is 16 LSB/microTesla
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);

	//write biases to accelerometer offset registers as 16 LSB/microTesla
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_LSB, (int16_t)mag_bias[0] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_MSB, ((int16_t)mag_bias[0] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_LSB, (int16_t)mag_bias[1] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_MSB, ((int16_t)mag_bias[1] >> 8) & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_LSB, (int16_t)mag_bias[2] & 0xFF);
	writeByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_MSB, ((int16_t)mag_bias[2] >> 8) & 0xFF);

	// Check that offsets were properly written to offset registers
//	NRF_LOG_INFO("Average magnetometer bias = %d, %d, %d\n",\
//						(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_X_LSB)),\
//						(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Y_LSB)),\
//						(int16_t)((int16_t)readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_MSB) << 8 | readByte(BNO055_ADDRESS, BNO055_MAG_OFFSET_Z_LSB)));

	// Select BNO055 system operation mode
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, bno055_config.opr_mode);
	nrf_delay_ms(25);

	NRF_LOG_INFO("Mag Calibration done!");
}


void bno055_initialize(void)
{
	// Select BNO055 config mode
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, CONFIGMODE );
	nrf_delay_ms(25);
	// Select page 1 to configure sensors
	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x01);
	// Configure ACC
	writeByte(BNO055_ADDRESS, BNO055_ACC_CONFIG, bno055_config.a_pwr_mode << 5 | bno055_config.a_bw << 2 | bno055_config.a_scale);
	// Configure GYR
	writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_0, bno055_config.g_bw << 3 | bno055_config.g_scale);
	writeByte(BNO055_ADDRESS, BNO055_GYRO_CONFIG_1, bno055_config.g_pwr_mode);
	// Configure MAG
	writeByte(BNO055_ADDRESS, BNO055_MAG_CONFIG, bno055_config.m_pwr_mode << 5 | bno055_config.m_op_mode << 3 | bno055_config.m_odr);

//	// Configure interrupt settings...
//	// Accelerometer any motion interrupt (4:2)
//	writeByte(BNO055_ADDRESS, BNO055_ACC_INT_SETTINGS, 0x1C);
//	writeByte(BNO055_ADDRESS, BNO055_ACC_AM_THRES, 0x00);
//	// Gyroscope any motion interrupt (
//	writeByte(BNO055_ADDRESS, BNO055_GYR_INT_SETTINGS, 0x47);
//	writeByte(BNO055_ADDRESS, BNO055_GYR_AM_THRESH, 0x00);
//	writeByte(BNO055_ADDRESS, BNO055_GYR_AM_SET, 0x00);
//	// Set interrupt mask (6 -> ACC_AM, 2 -> GYR_AM)
//	writeByte(BNO055_ADDRESS, BNO055_INT_MSK, 0x44);
//	// Enable interrupt
//	writeByte(BNO055_ADDRESS, BNO055_INT_EN, 0x44);
	
	// Select page 0 to read sensors
	writeByte(BNO055_ADDRESS, BNO055_PAGE_ID, 0x00);

	// Select BNO055 gyro temperature source 
	writeByte(BNO055_ADDRESS, BNO055_TEMP_SOURCE, 0x01 );

	// Select BNO055 sensor units (temperature in degrees C, rate in dps, accel in mg)
	writeByte(BNO055_ADDRESS, BNO055_UNIT_SEL, 0x01 );
	
	// Select BNO055 system power mode
	writeByte(BNO055_ADDRESS, BNO055_PWR_MODE, bno055_config.pwr_mode);

	// Select BNO055 system operation mode
	writeByte(BNO055_ADDRESS, BNO055_OPR_MODE, bno055_config.opr_mode);
	nrf_delay_ms(25);
}

void bno055_int_reset(void)
{
	writeByte(BNO055_ADDRESS, BNO055_SYS_TRIGGER, 0x40);
}


void bno055_poll_data(void)
{
	// read raw data storage
	int16_t data3[3], data4[4];
	float ax, ay, az, gx, gy, gz, mx, my, mz;
	float q[4];
	float yaw, pitch, roll;
	float lia[3], grv[3];
	uint8_t i;
	
    read_accel_data(data3);  // Read the x/y/z adc values
    // Now we'll calculate the accleration value into actual mg's
    ax = (float)data3[0]; // - accelBias[0];  // subtract off calculated accel bias
    ay = (float)data3[1]; // - accelBias[1];
    az = (float)data3[2]; // - accelBias[2];
	// Fill the sensor output table for later sending
	bno055_output.accel[0].val = ax;
	bno055_output.accel[1].val = ay;
	bno055_output.accel[2].val = az;
//	NRF_LOG_INFO("Raw acceleration: %x, %x, %x\n", (int32_t)(ax*10000.), (int32_t)(ay*10000.), (int32_t)(az*10000.));
	
	
    read_gyro_data(data3);  // Read the x/y/z adc values
    // Calculate the gyro value into actual degrees per second
    gx = (float)data3[0]/16.; // - gyroBias[0];  // subtract off calculated gyro bias
    gy = (float)data3[1]/16.; // - gyroBias[1];  
    gz = (float)data3[2]/16.; // - gyroBias[2];  
	// Fill the sensor output table for later sending
	bno055_output.gyro[0].val = gx;
	bno055_output.gyro[1].val = gy;
	bno055_output.gyro[2].val = gz;
//	NRF_LOG_INFO("Raw gyroscope   : %ld, %ld, %ld\n", (int32_t)(gx*10000.), (int32_t)(gy*10000.), (int32_t)(gz*10000.));

    read_mag_data(data3);  // Read the x/y/z adc values   
    // Calculate the magnetometer values in milliGauss
    mx = (float)data3[0]/1.6; // - magBias[0];  // get actual magnetometer value in mGauss 
    my = (float)data3[1]/1.6; // - magBias[1];  
    mz = (float)data3[2]/1.6; // - magBias[2];   
	// Fill the sensor output table for later sending
	bno055_output.mag[0].val = mx;
	bno055_output.mag[1].val = my;
	bno055_output.mag[2].val = mz;
//	NRF_LOG_INFO("Raw magnetometer: %ld, %ld, %ld\n", (int32_t)(mx*10000.), (int32_t)(my*10000.), (int32_t)(mz*10000.));
    
