sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
    read_quat_data(data4);  // Read the x/y/z adc values   
    // Calculate the quaternion values  
    q[0] = (float)(data4[0])/16384.;    
    q[1] = (float)(data4[1])/16384.;  
    q[2] = (float)(data4[2])/16384.;   
    q[3] = (float)(data4[3])/16384.;   
	// Fill the sensor output table for later sending
	bno055_output.quat[0].val = q[0];
	bno055_output.quat[1].val = q[1];
	bno055_output.quat[2].val = q[2];
	bno055_output.quat[3].val = q[3];
// 	NRF_LOG_INFO("Raw quaternions : %ld, %ld, %ld, %ld\n", (int32_t)(q[0]*10000.), (int32_t)(q[1]*10000.), (int32_t)(q[2]*10000.), (int32_t)(q[3]*10000.));
   
    read_euler_data(data3);  // Read the x/y/z adc values   
    // Calculate the Euler angles values in degrees
    yaw = (float)data3[0]/16.;  
    roll = (float)data3[1]/16.;  
    pitch = (float)data3[2]/16.;   
	// Fill the sensor output table for later sending
	bno055_output.yaw.val = yaw;
	bno055_output.roll.val = roll;
	bno055_output.pitch.val = pitch;
// 	NRF_LOG_INFO("Raw euler angles: %ld, %ld, %ld\n", (int32_t)(yaw*10000.), (int32_t)(roll*10000.), (int32_t)(pitch*10000.));

    read_lia_data(data3);  // Read the x/y/z adc values   
    // Calculate the linear acceleration (sans gravity) values in mg
    lia[0] = (float)data3[0];  
    lia[1] = (float)data3[1];  
    lia[2] = (float)data3[2];   
	// Fill the sensor output table for later sending
	bno055_output.lia[0].val = lia[0];
	bno055_output.lia[1].val = lia[1];
	bno055_output.lia[2].val = lia[2];
//	NRF_LOG_INFO("Raw LIA         : %ld, %ld, %ld\n", (int32_t)(lia[0]*10000.), (int32_t)(lia[1]*10000.), (int32_t)(lia[2]*10000.));

    read_grv_data(data3);  // Read the x/y/z adc values   
    // Calculate the linear acceleration (sans gravity) values in mg
    grv[0] = (float)data3[0];  
    grv[1] = (float)data3[1];  
    grv[2] = (float)data3[2];   
	// Fill the sensor output table for later sending
	bno055_output.grv[0].val = grv[0];
	bno055_output.grv[1].val = grv[1];
	bno055_output.grv[2].val = grv[2];
//	NRF_LOG_INFO("Raw gravity     : %ld, %ld, %ld\n", (int32_t)(grv[0]*10000.), (int32_t)(grv[1]*10000.), (int32_t)(grv[2]*10000.));

	// Chose (once) between unprecise but low-power ms app timer
	// and precise current-demanding us drv timer 
//	static uint32_t last_time_ms = 0;
//	uint32_t now_ms = app_timer_cnt_get();
//	uint32_t delta_ms = (now_ms - last_time_ms)/33;
//	last_time_ms = now_ms;
	static uint32_t last_time_us = 0;
	uint32_t now_us = nrf_drv_timer_capture(&TIMER_DELTA_US, NRF_TIMER_CC_CHANNEL0);
	uint32_t delta_us = now_us - last_time_us;
	last_time_us = now_us;
	// Fill the sensor output table for later sending
	bno055_output.ts_us = now_us;
	
//	float deltat = (float)delta_us/1000000.;

//	mahony_quaternion_update(ax, ay, az, gx*PI/180.0, gy*PI/180.0, gz*PI/180.0, my, mx, mz, deltat);
//	madgwick_quaternion_update(ax, ay, az, gx*PI/180.0, gy*PI/180.0, gz*PI/180.0, my, mx, mz, deltat);
//	mahony_quaternion_update(ax, ay, az, gx*PI/180.0, gy*PI/180.0, gz*PI/180.0, my, mx, mz, deltat);
//	madgwick_quaternion_update(ax, ay, az, gx*PI/180.0, gy*PI/180.0, gz*PI/180.0, my, mx, mz, deltat);
}


// Read accel data
void read_accel_data(int16_t *destination)
{
	// x/y/z accel register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers into data array
	readBytes(BNO055_ADDRESS, BNO055_ACC_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];      
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];  
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4]; 
}
// Read gyro data
void read_gyro_data(int16_t *destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_GYR_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];  
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4]; 
}
// Read temperature data
int16_t read_gyrotemp_data(void)
{
  return readByte(BNO055_ADDRESS, BNO055_TEMP);  // Read the two raw data registers sequentially into data array 
}

// Read magnetometer data
void read_mag_data(int16_t *destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_MAG_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}

// Read quaternion data
void read_quat_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[8];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_QUA_DATA_W_LSB, 8, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
	destination[3] = ((int16_t)rawData[7] << 8) | rawData[6];
}

// Read Euler angle data
void read_euler_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_EUL_HEADING_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}

// Read linear acceleration data
void read_lia_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_LIA_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}

