sschiesser/SMS_nRF5_sensors/sms_sensors2/sms_imu.c
// Read gravity vector
void read_grv_data(int16_t * destination)
{
	// x/y/z gyro register data stored here
	uint8_t rawData[6];
	// Read the six raw data registers sequentially into data array
	readBytes(BNO055_ADDRESS, BNO055_GRV_DATA_X_LSB, 6, &rawData[0]);
	// Turn the MSB and LSB into a signed 16-bit value
	destination[0] = ((int16_t)rawData[1] << 8) | rawData[0];
	destination[1] = ((int16_t)rawData[3] << 8) | rawData[2];
	destination[2] = ((int16_t)rawData[5] << 8) | rawData[4];
}




/**@brief Function for initializing the TWI module.
 */
//void twi_init(void)
//{
//	ret_code_t err_code;
//	const nrf_drv_twi_config_t twi_config = {
//		.scl				= TWI_SCL_PIN,
//		.sda				= TWI_SDA_PIN,
////		.frequency			= NRF_TWI_FREQ_100K,
//		.frequency			= NRF_TWI_FREQ_400K,
//		.interrupt_priority = APP_IRQ_PRIORITY_HIGH,
//		.clear_bus_init		= false
//		};
//	
//		err_code = nrf_drv_twi_init(&twi_master_instance, &twi_config, twi_event_handler, NULL);
//		APP_ERROR_CHECK(err_code);
//		
//		nrf_drv_twi_enable(&twi_master_instance);
//}

void writeByte(uint8_t address, uint8_t subAddress, uint8_t data)
{
	uint8_t reg[2] = {subAddress, data};
	twi_xfer_done = false;
	ret_code_t err_code = nrf_drv_twi_tx(&twi_master_instance, address, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done) {};
}

uint8_t readByte(uint8_t address, uint8_t subAddress)
{
	uint8_t reg[1] = {subAddress};
	twi_xfer_done = false;
	ret_code_t err_code = nrf_drv_twi_tx(&twi_master_instance, address, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
		
	uint8_t data;
	twi_xfer_done = false;
	err_code = nrf_drv_twi_rx(&twi_master_instance, address, &data, sizeof(data));
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
	
	return data;
}

void readBytes(uint8_t address, uint8_t subAddress, uint8_t count, uint8_t *dest)
{
	uint8_t reg[1] = {subAddress};
	twi_xfer_done = false;
	ret_code_t err_code = nrf_drv_twi_tx(&twi_master_instance, address, reg, sizeof(reg), false);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
	
	twi_xfer_done = false;
	err_code = nrf_drv_twi_rx(&twi_master_instance, address, dest, count);
	APP_ERROR_CHECK(err_code);
	while(!twi_xfer_done);
}
